package com.myzhihu.constant;

public class CommentForbiddenWords {
    public static final String[] words = {// 脏话与低俗用语
            "傻逼", "草泥马", "妈的", "去你妈的", "煞笔", "操你妈", "傻吊", "狗屎", "日你妈",
            "婊子", "渣男", "逼", "死全家", "死妈", "老母", "人渣", "垃圾", "废物", "傻逼", "阴道",
            "阴茎", "小鸡鸡", "肛门", "高潮", "嫖", "妓女", "鸡巴", "包子帝", "共匪",

            // 政治敏感词
            "台湾独立", "香港独立", "民主自由", "非法组织", "恐怖分子", "血腥", "暴乱", "邪教", "极端",
            "中共", "共产党", "五毛", "赵家人", "红卫兵", "毛主义", "马克思主义", "法轮功", "小粉红",
            "人权", "天安门", "六四", "一国两制", "反动", "颠覆", "恐怖活动", "黑社会", "走私", "诈骗",
            "贩毒", "偷渡", "反华", "民运", "枪支", "爆炸物", "核武器", "炸药", "纳粹", "种族歧视",
            "黑帮", "非法集会", "非法聚集", "恐怖主义", "敲诈", "勒索", "暴力", "枪击", "自杀", "极端主义",

            // 对特定人物的侮辱与攻击
            "习近平", "毛泽东", "邓小平", "李克强", "张德江", "栗战书", "王岐山", "朱镕基", "胡锦涛",
            "刘少奇", "林彪", "陈独秀", "赵紫阳", "薄熙来", "高层权斗", "官场斗争", "腐败", "钓鱼岛",
            "东海", "南海", "钓鱼岛争议", "历史问题", "台湾问题", "历史真相", "香港问题",

            // 禁忌词汇（特定群体侮辱）
            "同性恋", "LGBT", "变性人", "男同性恋", "女同性恋", "同志", "同性婚姻", "婚外情", "私生活",
            "第三者", "出轨", "堕胎", "婚姻不忠", "不伦", "性骚扰", "强奸", "诱奸", "性暴力", "强迫",

            // 与恐怖活动相关的词汇
            "爆炸", "炸弹", "枪支", "火器", "自杀式爆炸", "武器", "毒品", "毒气", "毒药", "地雷",
            "枪击", "暗杀", "暴动", "暴徒", "恐怖分子", "极端分子", "反政府", "袭击", "恐怖活动",
            "恐怖主义", "袭击者", "暗杀", "爆破", "火灾", "炸药", "炸弹制造", "自杀式炸弹",

            // 其他不当词汇
            "恶心", "不死心", "脑残", "白痴", "傻逼", "丧尸", "瞎了眼", "混蛋", "狗东西", "吃屎",
            "死鬼", "死啦死啦", "贱人", "滚蛋", "死了算了", "吃土", "喝西北风", "死了算", "烦死了",

            // 负面情绪与恶俗用语
            "脑袋被门夹了", "活该", "就这水平", "别再说了", "闭嘴", "滚犊子", "脑袋坏了", "傻得可以",
            "老死", "死去", "死了", "倒霉", "活该倒霉", "来日方长", "滚开", "去死", "死吧",

            // 与非法活动相关的词汇
            "赌博", "贩毒", "走私", "非法", "非法集资", "诈骗", "扒窃", "贼", "黑市", "偷盗",
            "洗钱", "信用卡盗刷", "赌博网站", "黑客", "电信诈骗", "网络赌博", "网络犯罪",

            // 淫秽内容相关
            "色情", "淫秽", "色图", "黄色", "艳照", "情色", "偷窥", "猥亵", "性虐待", "性交易",
            "成人用品", "成人网站", "性工作者", "男妓", "女妓", "低级趣味", "性暴力",

            // 隐私侵犯
            "隐私", "黑客攻击", "信息泄露", "个人信息", "窃取", "泄露", "追踪", "电话骚扰", "网络监控",
            "反间谍", "间谍活动", "情报窃取", "信息窃取"};
}
